In [1]:
from IPython.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

In [2]:
import numpy as np
import pandas as pd

In [18]:
df1 = pd.DataFrame({'key': ['a', 'b', 'c', 'd'],
                    'col1': ['1', '2', '3', '4']})
df1 = df1.set_index('key')
df2 = pd.DataFrame({'key': ['a', 'b', 'd', 'e'],
                    'col2': ['5', '6', '7', '8']})
df2 = df2.set_index('key')
display(df1,df2)

    col1
key
a      1
b      2
c      3
d      4

    col2
key
a      5
b      6
d      7
e      8

    col1
key
a      1
b      2
c      3
d      4

    col2
key
a      5
b      6
d      7
e      8

In [13]:
df1.merge(df2, how='left', on='key')

    col1 col2
key
a      1    5
b      2    6
c      3  NaN
d      4    7

In [14]:
df1.merge(df2, how='right', on='key')

    col1 col2
key
a      1    5
b      2    6
d      4    7
e    NaN    8

In [15]:
df1.merge(df2, how='outer', on='key')

    col1 col2
key
a      1    5
b      2    6
c      3  NaN
d      4    7
e    NaN    8

In [16]:
df1.merge(df2, how='inner', on='key')

    col1 col2
key
a      1    5
b      2    6
d      4    7

In [17]:
df1.merge(df2, how='cross')

   col1 col2
0     1    5
1     1    6
2     1    7
3     1    8
4     2    5
5     2    6
6     2    7
7     2    8
8     3    5
9     3    6
10    3    7
11    3    8
12    4    5
13    4    6
14    4    7
15    4    8

In [10]:
data = [10, 20, 30, 40, 50]
key = ["a", "b", "c", "d", "e"]
named_series = pd.Series(data, name="Sample Data", index=key)

# Seriesオブジェクトを表示
print(named_series)

a    10
b    20
c    30
d    40
e    50
Name: Sample Data, dtype: int64